Quanghoster/ESP8266HueEmulator/ESP8266HueEmulator/LightService.cpp
      }
      else
      {
        Serial.println("Can't open");
      }

    }
    else
    {
      //Serial.println("Not found");
    }  
  }
}

// returns true on failure
bool updateGroupSlot(int slot, String body) {
  char fileName[20];
  sprintf(fileName,GROUP_FILE_TEMPLATE,slot);
  
  aJsonObject *root;
  if (body != "") {
    Serial.print("updateGroupSlot:");
    Serial.println(body);
    root = validateGroupCreateBody(body);
  }
  if (!root && body != "") {
    // throw error bad body
    sendError(2, "groups/" + (slot + 1), "Bad JSON body");
    return true;
  }
  if (lightGroups[slot]) {
    delete lightGroups[slot];
    lightGroups[slot] = nullptr;
    if (SPIFFS.exists(fileName))
      SPIFFS.remove(fileName);
  }
  if (body != "") {
    Serial.print("Updating ");Serial.println(fileName);
    lightGroups[slot] = new LightGroup(root);
    File f = SPIFFS.open(fileName,"w");
    char* json = aJson.print(lightGroups[slot]->getJson());
    f.print(json);
    free(json);
    f.close();
    aJson.deleteItem(root);
  }
  return false;
}

void groupCreationHandler() {
  // handle group creation
  // find first available group slot
  int availableSlot = -1;
  for (int i = 0; i < 16; i++) {  // TEST start at 1 instead of 0
    if (!lightGroups[i]) {   
      availableSlot = i;
      break;
    }
  }
  if (availableSlot == -1) {
    // throw error no new groups allowed
    sendError(301, "groups", "Groups table full");
    return;
  }
  if (!updateGroupSlot(availableSlot, HTTP->arg("plain"))) {
    String slot = "";
    slot += (availableSlot + 1);
    sendSuccess("id", slot);
  }
}

aJsonObject *getGroupJson() {
  // iterate over groups and serialize
  aJsonObject *root = aJson.createObject();
  for (int i = 0; i < 16; i++) {
    if (lightGroups[i]) {
      String sIndex = "";
      sIndex += (i + 1);
      aJson.addItemToObject(root, sIndex.c_str(), lightGroups[i]->getJson());
    }
  }
  return root;
}

void groupListingHandler() {
  sendJson(getGroupJson());
}


int findSceneIndex(String id) {
  int index = -1;
  for (int i = 0; i < 16; i++) {
    LightGroup *scene = lightScenes[i];
    if (scene) {
      if (scene->id == id) {
        return i;
      }
    } else if (index == -1) {
      index = i;
    }
  }
  return index;
}

bool updateSceneSlot(int slot, String id, String body) {
  aJsonObject *root;
  if (body != "") {
    Serial.print("updateSceneSlot:");
    Serial.println(body);
    root = validateGroupCreateBody(body);
  }
  if (!root && body != "") {
    // throw error bad body
    sendError(2, "scenes/" + (slot + 1), "Bad JSON body");
    return true;
  }
  if (lightScenes[slot]) {
    char fileName[20];
    sprintf(fileName,SCENE_FILE_TEMPLATE,slot);
    delete lightScenes[slot];
    lightScenes[slot] = nullptr;
    if(SPIFFS.exists(fileName)){
      SPIFFS.remove(fileName);   
    }
  }
  if (body != "") {
    lightScenes[slot] = new LightGroup(root);
    aJson.deleteItem(root);
  }
  return false;
}

String scenePutHandler(String id) {
  Serial.print("sceneCreationHandler()");Serial.println(id);
  int sceneIndex = findSceneIndex(id);
  // handle scene creation
  // find first available scene slot
  if (sceneIndex == -1) {
    // throw error no new scenes allowed
    sendError(301, "scenes", "Scenes table full");
    return "";
  }
  // updateSceneSlot sends failure messages
  if (!updateSceneSlot(sceneIndex, id, HTTP->arg("plain"))) {
      id = String(sceneIndex,DEC);
    // TODO - add file saves here
    Serial.print("updating lightScene->id to ");Serial.println(id);
    lightScenes[sceneIndex]->id = id;

    aJsonObject *root= aJson.createArray();
    aJsonObject *response1 = aJson.createArray();
    aJsonObject *response2 = aJson.createArray();
    aJsonObject *lights = aJson.createArray();
          for (int i = 0; i < 16; i++) {
        if (!((1 << i) & lightScenes[sceneIndex]->getLightMask())) {
          continue;
        }
        // add light to list
        String lightNum = "";
        lightNum += (i + 1);
        aJson.addItemToArray(lights, aJson.createItem(lightNum.c_str()));
      }
    aJsonObject *addr1 = aJson.createObject();
    aJsonObject *addr2 = aJson.createObject();
    aJsonObject *success1 = aJson.createObject();
    aJsonObject *success2 = aJson.createObject();
    char addressBuffer[30];
    sprintf(addressBuffer,"/scenes/%d/name",sceneIndex);
    aJson.addStringToObject(addr1, "address", addressBuffer);
    aJson.addStringToObject(addr1, "value", lightScenes[sceneIndex]->getName().c_str());
    sprintf(addressBuffer,"/scenes/%d/lights",sceneIndex);
    aJson.addStringToObject(addr2, "address", addressBuffer);
    aJson.addItemToObject(addr2, "value", lights);   
     
    aJson.addItemToObject(success1, "success", addr1);
    aJson.addItemToObject(success2, "success", addr2);

    aJson.addItemToArray(root, success1);
    aJson.addItemToArray(root, success2);
    sendJson(root);
    
    // now save to file
    char fileName[20];
    sprintf(fileName,SCENE_FILE_TEMPLATE,sceneIndex);
    Serial.print("Updating Scene ");Serial.print(id);Serial.println(fileName);
    File f = SPIFFS.open(fileName,"w");
    char* json = aJson.print(lightScenes[sceneIndex]->getSceneJson(true));
    f.print(json);
    return id;
  }
}

void sceneCreationHandler(String id) {
  Serial.print("sceneCreationHandler()");Serial.println(id);
  int sceneIndex = findSceneIndex(id);
  // handle scene creation
  // find first available scene slot
  if (sceneIndex == -1) {
    // throw error no new scenes allowed
    sendError(301, "scenes", "Scenes table full");
    return;
  }
  // updateSceneSlot sends failure messages
  if (!updateSceneSlot(sceneIndex, id, HTTP->arg("plain"))) {
    //if (id == "") {
      id = String(sceneIndex,DEC);
    //}
    // TODO - add file saves here
    Serial.print("updating lightScene->id to ");Serial.println(id);
    lightScenes[sceneIndex]->id = id;
    sendSuccess("id", id);
    // now save to file
    char fileName[20];
    sprintf(fileName,SCENE_FILE_TEMPLATE,sceneIndex);
    Serial.print("Updating Scene ");Serial.print(id);Serial.println(fileName);
    File f = SPIFFS.open(fileName,"w");
    char* json = aJson.print(lightScenes[sceneIndex]->getSceneJson(true));
    f.print(json);
    
    return;
  }
}

aJsonObject *getSceneJson() {
  // iterate over scenes and serialize
  aJsonObject *root = aJson.createObject();
  for (int i = 0; i < 16; i++) {
    if (lightScenes[i]) {
      Serial.print("Returning Scene :");Serial.println(lightScenes[i]->id.c_str());
      aJson.addItemToObject(root, lightScenes[i]->id.c_str(), lightScenes[i]->getSceneJson(true));
    }
  }
  return root;
}

void sceneListingHandler() {
  sendJson(getSceneJson());
}

LightGroup *findScene(String id) {
  for (int i = 0; i < 16; i++) {
    LightGroup *scene = lightScenes[i];
    if (scene) {
      if (scene->id == id) {
        return scene;
      }
    }
  }
  return nullptr;
}

String methodToString(int method) {
  switch (method) {
    case HTTP_POST: return "POST";
    case HTTP_GET: return "GET";
    case HTTP_PUT: return "PUT";
    case HTTP_PATCH: return "PATCH";
    case HTTP_DELETE: return "DELETE";
    case HTTP_OPTIONS: return "OPTIONS";
    default: return "unknown";
  }
}

